# -*- coding: utf-8 -*-
#!/usr/bin/env python

"""Скрипт предназначен для анализа вывода скрипта analyze_background_sessions.py
Скрипт analyze_background_sessions.py выводит файл с выводом:

Этот вывод надо проанилизировать, а именно:
определить по какому контексту сколько ушло времени, например, сколько времени уходит на перепроведение документов, а сколько на очередь заданий и т.д
На вход скрипту надо подавать имя файла с результатом analyze_background_sessions.py

Что необходимо проанализировать:
1. По каким контекстам сколько уходит времени
    В абсолютных цифрах
    В относительном выражении от общего времени выполнения
2. Распределение времени по видам событий
    Сколько времени уходит на чистое процессороное время
        В абсолютных цифрах
        В относительных от общего времени выполнения по контексту"""

import sys
import os

if __name__ == '__main__':
    fd = open(sys.argv[1], 'rb')
    main_str = fd.read()
    sessions = main_str.split(('-'*50+os.sep)*2)
    for session in sessions:
        if session:
            print session
    pass


