# -*- coding: utf-8 -*-
#!/usr/bin/env python

'''
Скрипт предназначен для анализ сеансов.
Доделать - впихнуть пример использования.

На выходе получаем список экземпляров класса сеансов.

Что мы должны сделать:
На вход мы должны передать список файлов глобом
Пройтись по всем файлам, выдернуть оттуда все события.
По событию понять, что это за сеанса.
    Выдернуть номер сеанса,
    выдернуть имя пользователя.
    Тип: ФЗ, расширение веб-сервиса, и т.д.
    Первое событие - для этого мы должны знать дату из названия файла.
    Последнее событие
    Длительность работы сеанса
    События:
        Тип события - длительность
    Выделить длительность чистого вызова
        Вызов минус Длительность сколлов, минус длительность СУБД
    Контекст
        Из всех строк контекста получаем первые 5.
            для каждой строки получаем количество вхождений.
            оставляем первые 5.

Первые задачи:
    Сделать непрерывный генератор для входящих файлов.
    Сделать универсальный парсер для событий.
'''

import sys
import logsparseLib

def process_event(event):
    pass

if __name__ == '__main__':
    sessions = {}
    str_events = logsparseLib.read_events_from_files(sys.argv[1:], filter='t:applicationName=BackgroundJob')
    i=1
    for str_event in str_events:
        # print(str_event+'\n')
        if not i % 10000:
            print i
        event = logsparseLib.Event(str_event)
        process_event(event)
        i+=1