# -*- coding: utf-8 -*-
#!/usr/bin/env python

"""Скрипт предназначен для анализа вывода скрипта analyze_background_sessions.py
Скрипт analyze_background_sessions.py выводит файл с выводом:

Этот вывод надо проанилизировать, а именно:
определить по какому контексту сколько ушло времени, например, сколько времени уходит на перепроведение документов, а сколько на очередь заданий и т.д
На вход скрипту надо подавать имя файла с результатом analyze_background_sessions.py

Что необходимо проанализировать:
1. По каким контекстам сколько уходит времени
    В абсолютных цифрах
    В относительном выражении от общего времени выполнения
2. Распределение времени по видам событий
    Сколько времени уходит на чистое процессороное время
        В абсолютных цифрах
        В относительных от общего времени выполнения по контексту"""

import sys
import os
import json


def define_context_sign():
    """Определяем список строк-признаков, по которым однозначно можно определить чем занималось фоновое задание"""
    context_signs = (
      "ВыполнитьЗаданиеОчереди", #  Работа воркеров очереди заданий
      "РегистрСведений.ЗадачиБухгалтера.МодульМенеджера", # Фоновое задание обновление начального экрана в БП для руководителя
      "Обработка.ГрупповоеПерепроведениеДокументов.МодульМенеджера", # Групповое перепроведение, в представлении не нуждается
      "РегламентированнаяОтчетность.ВыполнитьПроверку", # Работа с регламентированной отчетностью
     )
    for sign in context_signs:
        context_result[sign] = {}


if __name__ == '__main__':
    context_result = {}
    context_signs = define_context_sign()

    fd = open(sys.argv[1], 'rb')
    main_str = fd.read()
    sessions = json.loads(main_str)
    for session in sessions:
        for line in sessions[session]['context_lines']:
            for sign in context_signs:
                if 
    pass


